Repository: Viruzober/MagicKeys
Catalog: Locale/*/LC_MESSAGES/MagicKeys.po
Languages: ru, ru_ru

source: For MagicKeys to work correctly, you need to set the screen scale to 100%. When you click the "yes" button, this will be done automatically.
ru: Чтобы MagicKeys работал корректно, необходимо установить масштаб экрана на 100%. Когда вы нажмете кнопку «да», это будет сделано автоматически.

source: Warning
ru: Внимание
ru_ru: Внимание

source: Also, for the MagicKeys to work properly, you need to set the maximum display resolution. Click "Yes" to automatically apply the parameter.
ru: Также, чтобы MagicKeys работал корректно, нужно установить максимальное разрешение экрана. Нажмите «Да», чтобы автоматически применить параметр.

source: Attention
ru: Внимание

source: Use left/right arrow keys for navigation
ru: Использовать клавиши горизонтальных стрелок для навигации
ru_ru: Использовать клавиши горизонтальных стрелок для навигации

source: Enable sounds
ru: Включить звуки
ru_ru: Включить звуки

source: Window detection timeout (ms):
ru: Задержка при определении окон (мс):
ru_ru: Задержка при определении окон (мс):

source: Speak control types
ru: Говорить типы элементов управления
ru_ru: Говорить типы элементов управления

source: Ask before exiting
ru: Спрашивать перед выходом
ru_ru: Спрашивать перед выходом

source: Update channel
ru: Канал обновлений

source: check for updates when magicKeys starts
ru: Проверять наличие обновлений при запуске magicKeys

source: Help
ru: Справка
ru_ru: Справка

source: Save
ru: Сохранить
ru_ru: Сохранить

source: Cancel
ru: Отмена
ru_ru: Отмена

source: Settings
ru: Настройки
ru_ru: Настройки

source: Plugins
ru: Плагины

source: Result
ru: Результат

source: Install
ru: Установить

source: You must close MagicKeys to run DeveloperTool.
ru: Для запуска DeveloperTool необходимо закрыть MagicKeys.

source: Error
ru: Ошибка
ru_ru: Ошибка

source: DeveloperTool is ready
ru: DeveloperTool готов

source: This window appears to be out off screen. Do you want to move it to the visible area?
ru: Это окно отображается за пределами экрана. Вы хотите переместить его в видимую область?

source: Image name
ru: Название изображения

source: Enter image name.
ru: Введите название изображения.

source: Mouse X
ru: координата мыши X

source: Enter new mouse position X
ru: Введите новую позицию мыши X

source: Mouse Y
ru: Координата мыши Y

source: Enter new mouse position Y
ru: Введите новое положение мыши Y

source: Mouse step
ru: Шаг мыши

source: Enter mouse step:
ru: Введите шаг мыши в пикселях:

source: No rectangle for OCR
ru: Нет прямоугольника для OCR

source: OCR Zoom
ru: увеличение OCR

source: Enter OCR Zoom value:
ru: Введите значение увеличения для OCR:

source: OCR Width
ru: Ширина OCR

source: Enter OCR width:
ru: Введите ширину OCR:

source: OCR Height
ru: Высота OCR

source: Enter OCR height:
ru: Введите высоту OCR:

source: The project for this module already exists
ru: Проект для этого модуля уже существует

source: Do you really want to delete current project?
ru: Вы действительно хотите удалить текущий проект?

source: Delete current project
ru: Удаление текущего проекта

source: Project is not opened
ru: Проект не открыт

source: project is opened
ru: проект открыт

source: Width
ru: Ширина

source: Height
ru: Высота

source: Window is not fully visible.
ru: Окно видно не полностью.

source: Control search
ru: Поиск элемента управления

source: Enter or select module name
ru: Введите или выберите имя модуля

source: Some fields are empty.
ru: Некоторые поля пусты.

source: A project with the same name already exists.
ru: Проект с таким именем уже существует.

source: Create project
ru: Создать проект

source: Name:
ru: Название:

source: Author:
ru: Автор:

source: Main entry point:
ru: Основная точка входа:

source: Starting VUI:
ru: Запуск VUI:

source: Module:
ru: Модуль:

source: A VUI with the same name already exists.
ru: VUI с таким именем уже существует.

source: EditProject
ru: РедактироватьПроект

source: OCR Word List
ru: список ключевых слов OCR

source: Edit point
ru: редактировать точку входа

source: Entry Point Name
ru: Имя точки входа

source: Enter new entry point name.
ru: Введите новое имя точки входа.

source: An entry point with the same name already exists.
ru: Точка входа с таким именем уже существует.

source: Do you really want to delete the selected entry point?
ru: Вы действительно хотите удалить выбранную точку входа?

source: Delete Entry Point
ru: Удаление точки входа

source: Add
ru: Добавить

source: Delete
ru: Удалить

source: Edit
ru: Редактировать

source: Close
ru: Закрыть

source: Point manager
ru: Менеджер точек входа

source: Points:
ru: Точки входа:

source: VUI Name
ru: Название VUI

source: Enter new VUI name.
ru: Введите новое имя VUI.

source: An VUI with the same name already exists.
ru: VUI с таким именем уже существует.

source: Do you really want to delete the selected VUI?
ru: Вы действительно хотите удалить выбранный VUI?

source: Delete VUI
ru: Удаление VUI

source: VUI object Name
ru: Название объекта VUI

source: Enter new VUI object name.
ru: Введите новое имя объекта VUI.

source: An Object with the same name already exists.
ru: Объект с таким именем уже существует.

source: Do you really want to delete the selected VUI object?
ru: Вы действительно хотите удалить выбранный объект VUI?

source: Delete VUI object
ru: Удаление объекта VUI

source: Rename
ru: Переименовать

source: VUI manager
ru: Менеджер VUI

source: Objects:
ru: Объекты:

source: This version of MagicKeys is built for 32-bit Windows, but you are running a 64-bit version. Please run a 64-bit version of MagicKeys instead.
ru: Эта версия MagicKeys предназначена для 32-разрядных версий Windows, но вы используете 64-разрядную версию. Пожалуйста запустите 64-разрядную версию MagicKeys.
ru_ru: Эта версия MagicKeys предназначена для 32-разрядных версий Windows, но вы используете 64-разрядную версию. Пожалуйста запустите 64-разрядную версию MagicKeys.

source: You must close DeveloperTool to run MagicKeys.
ru: Для запуска MagicKeys необходимо закрыть DeveloperTool.

source: MagicKeys is ready
ru: Сервис MagicKeys запущен
ru_ru: Сервис MagicKeys запущен

source: MagicKeys is already running.
ru: Программа MagicKeys уже запущена.
ru_ru: Программа MagicKeys уже запущена.

source: Help file not found
ru: Файл справки не найден
ru_ru: Файл справки не найден

source: Method {0} is not implemented
ru: Метод {0} не реализован
ru_ru: Метод {0} не реализован

source: Enter a value for
ru: Введите значение для

source: from 1 to 100
ru: от 1 до 100

source: No plugins are available.
ru: Нет доступных плагинов.
ru_ru: Нет доступных плагинов.

source: Do you really want to exit MagicKeys?
ru: Вы действительно хотите завершить работу MagicKeys?
ru_ru: Вы действительно хотите завершить работу MagicKeys?

source: Exit MagicKeys
ru: Выйти из MagicKeys
ru_ru: Выйти из MagicKeys

source: Goodbye
ru: Пока
ru_ru: Пока

source: Check for updates
ru: Проверить наличие обновлений

source: Exit
ru: Выход
ru_ru: Выход

source: MagicKeys {0} is enabled
ru: MagicKeys {0} включен
ru_ru: MagicKeys {0} включен

source: MagicKeys {0} is disabled
ru: MagicKeys {0} выключен
ru_ru: MagicKeys {0} выключен

source: MagicKeys is disabled
ru: MagicKeys выключен
ru_ru: MagicKeys выключен

source: MagicKeys is enabled
ru: MagicKeys включен
ru_ru: MagicKeys включен

source: Sounds off
ru: Звуки выключены
ru_ru: Звуки выключены

source: Sounds on
ru: Звуки включены
ru_ru: Звуки включены

source: No updates available.
ru: Нет доступных обновлений.

source: Information
ru: Информация

source: the update server returned an error. Please try again later.
ru: сервер обновлений вернул ошибку. Повторите попытку позже.

source: Something has gone wrong. Please check your internet connection.
ru: Что-то пошло не так. Пожалуйста, проверьте подключение к Интернету.

source: Changelog
ru: Список изменений

source: Update
ru: Обновить

source: Update MagicKeys
ru: Обновление MagicKeys

source: Please close these programs before updating.
ru: Пожалуйста, закройте эти программы перед обновлением.

source: Error Downloading update. Please try again later.
ru: Ошибка загрузки обновления. Повторите попытку позже.

source: Update file is corrupted.
ru: Файл обновления поврежден.

source: Windows 10 OCR is unavailable
ru_ru: Компонент Windows 10 OCR недоступен

source: Section not found
ru_ru: Раздел не найден

source: The value is not correct
ru_ru: Значение неверно

source: Key not found
ru_ru: Ключ не найден

source: Error reading file
ru_ru: Ошибка чтения файла

source: Message:
ru_ru: Сообщение:

source: File:
ru_ru: Файл:

source: Line:
ru_ru: Строка:

source: Section:
ru_ru: Раздел:

source: Key:
ru_ru: Ключ:

source: The keyboard shortcut cannot be registered
ru_ru: Не удалось зарегистрировать сочетание клавиш

source: File not found
ru_ru: Файл не найден

source: Send anonymous diagnostic information about the system
ru_ru: Отправлять анонимную диагностическую информацию о системе
